app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT  "articles".* FROM "articles"  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hello world"], ["body", "this is a test article."], ["user_id", 1], ["created_at", "2016-03-25 20:57:41.412598"], ["updated_at", "2016-03-25 20:57:41.412598"]]