app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(params[:comment].permit(:body))
    @comment.user_id = current_user.id if current_user


    if @comment.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "hwllo\r\n"], ["article_id", 3], ["created_at", "2016-03-27 10:15:40.206474"], ["updated_at", "2016-03-27 10:15:40.206474"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 4], ["updated_at", "2016-03-27 10:15:40.230657"], ["id", 1]]